Revit 2027 API
IFCParameterTemplate Constructor
 Custom constructor for this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCParameterTemplate(
	Document document
)
Public Sub New (
	document As Document
)
public:
IFCParameterTemplate(
	Document^ document
)
new :
        document : Document -> IFCParameterTemplate
Parameters
document Document
 The document where created template is saved.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace